Day1/ejercicios_clase/taskly/app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."completed" = ?  [["user_id", 1], ["completed", "t"]]
---
  def index
    completed_tasks = @user.tasks.where(completed: true)

INSERT INTO "tasks" ("name", "due_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "yeha"], ["due_date", "0009-09-09 00:00:00.000000"], ["user_id", 1], ["created_at", "2016-05-09 08:30:10.753911"], ["updated_at", "2016-05-09 08:30:10.753911"]]
---
    task = @user.tasks.create(task_params)