Day1/ejercicios_clase/taskly/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pepe"], ["email", "mail@mail.com"], ["created_at", "2016-05-09 08:09:51.661585"], ["updated_at", "2016-05-09 08:09:51.661585"]]
---
  def create
    user = User.create(user_params)

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "pepin"], ["updated_at", "2016-05-09 08:13:38.789483"], ["id", 5]]
---
  def update
    @user.update(user_params)