Day5/bbq-master/app/controllers/barbecues_controller.rb

SELECT "barbecues".* FROM "barbecues"  ORDER BY "barbecues"."date" ASC
---
  def index
    @barbecues = Barbecue.order(:date)