Day5/bbq-master/app/controllers/api/barbecues_controller.rb

SELECT  "barbecues".* FROM "barbecues" WHERE "barbecues"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    barbecues = Barbecue.find(params[:id])