Day1/exercise/sandwichr-master/app/controllers/sandwiches_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
	  sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
	  sandwich = Sandwich.find_by(id: params[:id])