Day4/exercise/auctionsite/app/controllers/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY lower(title) ASC
---
  def index
    @products = Product.all.order("lower(title) ASC")

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # @user = User.find(params[:id])
    @product = Product.find(params[:id])

INSERT INTO "products" ("title", "description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdsa"], ["description", "asdasd"], ["deadline", "2016-04-14 00:00:00.000000"], ["created_at", "2016-04-27 14:35:41.759972"], ["updated_at", "2016-04-27 14:35:41.759972"]]
---
  def create
    @product = Product.new(
      title: params[:product][:title],
      description: params[:product][:description],
      deadline: params[:product][:deadline]
    )
    @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    Product.destroy(params[:id])