Day2/ejercicios_clase/taskly_ironhack-master/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "user_id", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["user_id", 0], ["due_date", "2016-05-10 08:31:00.000000"], ["created_at", "2016-05-10 08:32:06.843293"], ["updated_at", "2016-05-10 08:32:06.843293"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "asdafasf"], ["updated_at", "2016-05-10 08:32:20.377872"], ["id", 9]]